IDEA Open Model
ResultOfNLA2 Class
Compatible with IDEA StatiCa 20.1
Note: This API is now obsolete.
 Result of internal forces in the one position
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOfLoading2
 IdeaRS.OpenModel.Result.ResultOfNLA2
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[ObsoleteAttribute]
public class ResultOfNLA2 : ResultOfLoading2
<ObsoleteAttribute>
Public Class ResultOfNLA2
	Inherits ResultOfLoading2
The ResultOfNLA2 type exposes the following members.
Constructors
Name | Description
ResultOfNLA2
 Constructor
Top
Properties
Name | Description
Points
 Results in section
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace